openfoam/dtmb4381_openwater/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 2);   // U∞ = 2 m/s along +z (shaft axis)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    sides
    {
        type            slip;
    }
    propeller
    {
        type            movingWallVelocity;   // no-slip in the rotating zone
        value           uniform (0 0 0);
    }
}
