openfoam/dtmb4381_openwater/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;   // matched-Re code-to-code comparison (Re_D = 5e3)
